{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 128, 128, 1], "sparse": false}}, {"name": "Conv1_pad", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "Conv1_pad", "padding": [[0, 1], [0, 1]]}}, {"name": "Conv1", "inbound_nodes": [[["Conv1_pad", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "Conv1", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 48, "kernel_size": [3, 3], "padding": "valid"}}, {"name": "bn_Conv1", "inbound_nodes": [[["Conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "bn_Conv1", "gamma_regularizer": null, "axis": -1}}, {"name": "Conv1_relu", "inbound_nodes": [[["bn_Conv1", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "Conv1_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "expanded_conv_depthwise", "inbound_nodes": [[["Conv1_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "depth_multiplier": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "trainable": true, "depthwise_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": false, "name": "expanded_conv_depthwise", "kernel_size": [3, 3], "padding": "same"}}, {"name": "expanded_conv_depthwise_BN", "inbound_nodes": [[["expanded_conv_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "expanded_conv_depthwise_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "expanded_conv_depthwise_relu", "inbound_nodes": [[["expanded_conv_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "expanded_conv_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "expanded_conv_project", "inbound_nodes": [[["expanded_conv_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "expanded_conv_project", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 24, "kernel_size": [1, 1], "padding": "same"}}, {"name": "expanded_conv_project_BN", "inbound_nodes": [[["expanded_conv_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "expanded_conv_project_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_1_expand", "inbound_nodes": [[["expanded_conv_project_BN", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_1_expand", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 144, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_1_expand_BN", "inbound_nodes": [[["block_1_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_1_expand_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_1_expand_relu", "inbound_nodes": [[["block_1_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_1_expand_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_1_pad", "inbound_nodes": [[["block_1_expand_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "block_1_pad", "padding": [[0, 1], [0, 1]]}}, {"name": "block_1_depthwise", "inbound_nodes": [[["block_1_pad", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "depth_multiplier": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "trainable": true, "depthwise_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": false, "name": "block_1_depthwise", "kernel_size": [3, 3], "padding": "valid"}}, {"name": "block_1_depthwise_BN", "inbound_nodes": [[["block_1_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_1_depthwise_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_1_depthwise_relu", "inbound_nodes": [[["block_1_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_1_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_1_project", "inbound_nodes": [[["block_1_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_1_project", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 40, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_1_project_BN", "inbound_nodes": [[["block_1_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_1_project_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_2_expand", "inbound_nodes": [[["block_1_project_BN", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_2_expand", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 240, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_2_expand_BN", "inbound_nodes": [[["block_2_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_2_expand_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_2_expand_relu", "inbound_nodes": [[["block_2_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_2_expand_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_2_depthwise", "inbound_nodes": [[["block_2_expand_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "depth_multiplier": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "trainable": true, "depthwise_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": false, "name": "block_2_depthwise", "kernel_size": [3, 3], "padding": "same"}}, {"name": "block_2_depthwise_BN", "inbound_nodes": [[["block_2_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_2_depthwise_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_2_depthwise_relu", "inbound_nodes": [[["block_2_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_2_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_2_project", "inbound_nodes": [[["block_2_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_2_project", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 40, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_2_project_BN", "inbound_nodes": [[["block_2_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_2_project_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_2_add", "inbound_nodes": [[["block_1_project_BN", 0, 0, {}], ["block_2_project_BN", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "block_2_add"}}, {"name": "block_3_expand", "inbound_nodes": [[["block_2_add", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_3_expand", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 240, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_3_expand_BN", "inbound_nodes": [[["block_3_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_3_expand_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_3_expand_relu", "inbound_nodes": [[["block_3_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_3_expand_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_3_pad", "inbound_nodes": [[["block_3_expand_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "block_3_pad", "padding": [[0, 1], [0, 1]]}}, {"name": "block_3_depthwise", "inbound_nodes": [[["block_3_pad", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "depth_multiplier": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "trainable": true, "depthwise_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": false, "name": "block_3_depthwise", "kernel_size": [3, 3], "padding": "valid"}}, {"name": "block_3_depthwise_BN", "inbound_nodes": [[["block_3_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_3_depthwise_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_3_depthwise_relu", "inbound_nodes": [[["block_3_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_3_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_3_project", "inbound_nodes": [[["block_3_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_3_project", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 48, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_3_project_BN", "inbound_nodes": [[["block_3_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_3_project_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_4_expand", "inbound_nodes": [[["block_3_project_BN", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_4_expand", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 288, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_4_expand_BN", "inbound_nodes": [[["block_4_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_4_expand_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_4_expand_relu", "inbound_nodes": [[["block_4_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_4_expand_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_4_depthwise", "inbound_nodes": [[["block_4_expand_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "depth_multiplier": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "trainable": true, "depthwise_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": false, "name": "block_4_depthwise", "kernel_size": [3, 3], "padding": "same"}}, {"name": "block_4_depthwise_BN", "inbound_nodes": [[["block_4_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_4_depthwise_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_4_depthwise_relu", "inbound_nodes": [[["block_4_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_4_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_4_project", "inbound_nodes": [[["block_4_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_4_project", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 48, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_4_project_BN", "inbound_nodes": [[["block_4_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_4_project_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_4_add", "inbound_nodes": [[["block_3_project_BN", 0, 0, {}], ["block_4_project_BN", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "block_4_add"}}, {"name": "block_5_expand", "inbound_nodes": [[["block_4_add", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_5_expand", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 288, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_5_expand_BN", "inbound_nodes": [[["block_5_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_5_expand_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_5_expand_relu", "inbound_nodes": [[["block_5_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_5_expand_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_5_depthwise", "inbound_nodes": [[["block_5_expand_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "depth_multiplier": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "trainable": true, "depthwise_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": false, "name": "block_5_depthwise", "kernel_size": [3, 3], "padding": "same"}}, {"name": "block_5_depthwise_BN", "inbound_nodes": [[["block_5_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_5_depthwise_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_5_depthwise_relu", "inbound_nodes": [[["block_5_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_5_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_5_project", "inbound_nodes": [[["block_5_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_5_project", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 48, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_5_project_BN", "inbound_nodes": [[["block_5_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_5_project_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_5_add", "inbound_nodes": [[["block_4_add", 0, 0, {}], ["block_5_project_BN", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "block_5_add"}}, {"name": "block_6_expand", "inbound_nodes": [[["block_5_add", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_6_expand", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 288, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_6_expand_BN", "inbound_nodes": [[["block_6_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_6_expand_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_6_expand_relu", "inbound_nodes": [[["block_6_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_6_expand_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_6_pad", "inbound_nodes": [[["block_6_expand_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"trainable": true, "data_format": "channels_last", "name": "block_6_pad", "padding": [[0, 1], [0, 1]]}}, {"name": "block_6_depthwise", "inbound_nodes": [[["block_6_pad", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "depth_multiplier": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "trainable": true, "depthwise_regularizer": null, "dilation_rate": [1, 1], "strides": [2, 2], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": false, "name": "block_6_depthwise", "kernel_size": [3, 3], "padding": "valid"}}, {"name": "block_6_depthwise_BN", "inbound_nodes": [[["block_6_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_6_depthwise_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_6_depthwise_relu", "inbound_nodes": [[["block_6_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_6_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_6_project", "inbound_nodes": [[["block_6_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_6_project", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 96, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_6_project_BN", "inbound_nodes": [[["block_6_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_6_project_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_7_expand", "inbound_nodes": [[["block_6_project_BN", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_7_expand", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 576, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_7_expand_BN", "inbound_nodes": [[["block_7_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_7_expand_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_7_expand_relu", "inbound_nodes": [[["block_7_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_7_expand_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_7_depthwise", "inbound_nodes": [[["block_7_expand_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "depth_multiplier": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "trainable": true, "depthwise_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": false, "name": "block_7_depthwise", "kernel_size": [3, 3], "padding": "same"}}, {"name": "block_7_depthwise_BN", "inbound_nodes": [[["block_7_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_7_depthwise_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_7_depthwise_relu", "inbound_nodes": [[["block_7_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_7_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_7_project", "inbound_nodes": [[["block_7_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_7_project", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 96, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_7_project_BN", "inbound_nodes": [[["block_7_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_7_project_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_7_add", "inbound_nodes": [[["block_6_project_BN", 0, 0, {}], ["block_7_project_BN", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "block_7_add"}}, {"name": "block_8_expand", "inbound_nodes": [[["block_7_add", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_8_expand", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 576, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_8_expand_BN", "inbound_nodes": [[["block_8_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_8_expand_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_8_expand_relu", "inbound_nodes": [[["block_8_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_8_expand_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_8_depthwise", "inbound_nodes": [[["block_8_expand_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "depth_multiplier": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "trainable": true, "depthwise_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": false, "name": "block_8_depthwise", "kernel_size": [3, 3], "padding": "same"}}, {"name": "block_8_depthwise_BN", "inbound_nodes": [[["block_8_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_8_depthwise_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_8_depthwise_relu", "inbound_nodes": [[["block_8_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_8_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_8_project", "inbound_nodes": [[["block_8_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_8_project", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 96, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_8_project_BN", "inbound_nodes": [[["block_8_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_8_project_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_8_add", "inbound_nodes": [[["block_7_add", 0, 0, {}], ["block_8_project_BN", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "block_8_add"}}, {"name": "block_9_expand", "inbound_nodes": [[["block_8_add", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_9_expand", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 576, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_9_expand_BN", "inbound_nodes": [[["block_9_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_9_expand_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_9_expand_relu", "inbound_nodes": [[["block_9_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_9_expand_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_9_depthwise", "inbound_nodes": [[["block_9_expand_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "depth_multiplier": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "trainable": true, "depthwise_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": false, "name": "block_9_depthwise", "kernel_size": [3, 3], "padding": "same"}}, {"name": "block_9_depthwise_BN", "inbound_nodes": [[["block_9_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_9_depthwise_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_9_depthwise_relu", "inbound_nodes": [[["block_9_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_9_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_9_project", "inbound_nodes": [[["block_9_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_9_project", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 96, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_9_project_BN", "inbound_nodes": [[["block_9_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_9_project_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_9_add", "inbound_nodes": [[["block_8_add", 0, 0, {}], ["block_9_project_BN", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "block_9_add"}}, {"name": "block_10_expand", "inbound_nodes": [[["block_9_add", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_10_expand", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": false, "filters": 576, "kernel_size": [1, 1], "padding": "same"}}, {"name": "block_10_expand_BN", "inbound_nodes": [[["block_10_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_10_expand_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_10_expand_relu", "inbound_nodes": [[["block_10_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_10_expand_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_10_depthwise", "inbound_nodes": [[["block_10_expand_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"activation": "linear", "activity_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "depth_multiplier": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "trainable": true, "depthwise_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": false, "name": "block_10_depthwise", "kernel_size": [3, 3], "padding": "same"}}, {"name": "block_10_depthwise_BN", "inbound_nodes": [[["block_10_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "scale": true, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "momentum": 0.999, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "block_10_depthwise_BN", "gamma_regularizer": null, "axis": -1}}, {"name": "block_10_depthwise_relu", "inbound_nodes": [[["block_10_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"max_value": 6.0, "trainable": true, "name": "block_10_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0}}, {"name": "block_10_project", "inbound_nodes": [[["block_10_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "data_format": "channels_last", "name": "block_10_project", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "trainable": 